bit-finance/InformationRegisters/бит_ПараметрыСообщенийТелеграм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ПараметрыСообщенийТелеграм</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПараметра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЧатыTelegram</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СообщениеИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/InformationRegisters/бит_ПараметрыСообщенийТелеграм/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура сохраняет значения параметров сообщения в систему.
//
// Параметры:
//	ПараметрыКлюча - Структура - см. функцию НовыеПараметрыКлюча().
//	ПараметрыСообщения - Структура - структура сохраняемых параметров:
//		* Ключ     - Имя параметра.
//		* Значение - Значение сохраняемого параметра.
//
Процедура СохранитьПараметрыСообщения(ПараметрыКлюча, ПараметрыСообщения) Экспорт
	
	Если ПараметрыСообщения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборПараметров = РегистрыСведений.бит_ПараметрыСообщенийТелеграм.СоздатьНаборЗаписей();
	НаборПараметров.Отбор.Чат.Установить(ПараметрыКлюча.Чат);
	НаборПараметров.Отбор.СообщениеИД.Установить(ПараметрыКлюча.СообщениеИД);
	Для каждого ПараметрСообщения Из ПараметрыСообщения Цикл
		ЗаписьПараметра                   = НаборПараметров.Добавить();
		ЗаписьПараметра.Чат               = ПараметрыКлюча.Чат;
		ЗаписьПараметра.СообщениеИД       = ПараметрыКлюча.СообщениеИД;
		ЗаписьПараметра.Параметр          = ПараметрСообщения.Ключ;
		ЗаписьПараметра.ЗначениеПараметра = ПараметрСообщения.Значение;
		ЗаписьПараметра.ДатаОтправки      = ТекущаяДатаСеанса();
	КонецЦикла;
	НаборПараметров.Записать();
	
КонецПроцедуры

// Функция возвращает значения параметров сообщения.
//
// Параметры:
//	ПараметрыКлюча - Структура - см. функцию НовыеПараметрыКлюча().
//
// Возвращаемое значение:
//	Структура - Структура параметров сообщения:
//		* Ключ     - Строка - Имя параметра.
//		* Значение - Произвольный - Значение сохраняемого параметра.
//
Функция ПараметрыСообщения(ПараметрыКлюча) Экспорт
	
	ПараметрыСообщения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ПараметрыСообщенийТелеграм.Параметр КАК Параметр,
	|	бит_ПараметрыСообщенийТелеграм.ЗначениеПараметра КАК ЗначениеПараметра
	|ИЗ
	|	РегистрСведений.бит_ПараметрыСообщенийТелеграм КАК бит_ПараметрыСообщенийТелеграм
	|ГДЕ
	|	бит_ПараметрыСообщенийТелеграм.Чат = &Чат
	|	И бит_ПараметрыСообщенийТелеграм.СообщениеИД = &СообщениеИД";
	Запрос.УстановитьПараметр("Чат",         ПараметрыКлюча.Чат);
	Запрос.УстановитьПараметр("СообщениеИД", ПараметрыКлюча.СообщениеИД);
	ВыборкаПараметров = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПараметров.Следующий() Цикл
		ПараметрыСообщения.Вставить(ВыборкаПараметров.Параметр, ВыборкаПараметров.ЗначениеПараметра);
	КонецЦикла;
	
	Возврат ПараметрыСообщения;
	
КонецФункции

// Процедура удаляет историю записей регистра бит_ПараметрыСообщенийТелеграм.
// 
// Параметры:
//  РежимСообщений    - Строка.
// 
Процедура УдалитьИсториюЗаписей(РежимСообщений = "Нет") Экспорт
	
	РежимыВывода = бит_ОбщегоНазначения.ОпределитьРежимыВывода(РежимСообщений);		
	
	РезультатЗапроса = УстаревшиеЗаписи();
	
	Если РезультатЗапроса.Пустой() Тогда		
		ТекстСообщения = НСтр("ru='Нет данных для обработки.';en='No data was provided.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Ном = 1;
	КоличествоЗаписей = Выборка.Количество();	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.бит_ПараметрыСообщенийТелеграм.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		Попытка			
			МенеджерЗаписи.Удалить();			
		Исключение			
			Если РежимыВывода.ВыводитьОшибки Тогда			
				ТекстСообщения = НСтр("ru='Не удалось удалить историю записей регистра ""%1"".';
						  	  		  |en='Failed to delete the history records for ""%1"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Метаданные.РегистрыСведений.бит_ПараметрыСообщенийТелеграм.Представление());
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецЕсли;			
		КонецПопытки; 
		
		Ном = Ном + 1;
	КонецЦикла; 
	
	Если РежимыВывода.ВыводитьИнформацию Тогда		
		ТекстСообщения = НСтр("ru='Удаление истории записей завершено.';
							  |en='Removing history records completed'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
	КонецЕсли; 	
	
КонецПроцедуры

// Функция формирует структуру параметров обработки записей регистра.
//
// Возвращаемое значение:
//	Структура - параметры обработки записей:
//		* Чат         - СправочникСсылка.бит_ЧатыTelegram;
//		* СообщениеИД - Число.
//
Функция НовыеПараметрыКлюча() Экспорт
	
	ПараметрыКлюча = Новый Структура;
	ПараметрыКлюча.Вставить("Чат", Справочники.бит_ЧатыTelegram.ПустаяСсылка());
	ПараметрыКлюча.Вставить("СообщениеИД", 0);
	
	Возврат ПараметрыКлюча;
	
КонецФункции

// Функция возвращает структуру параметров диалога в разрезе чата.
//
// Параметры:
//  Чат - СправочникСсылка.бит_ЧатыTelegram.
//
// Возвращаемое значение:
//	Структура - См. НовыеПараметрыДиалога().
//
Функция ПараметрыДиалога(Чат) Экспорт
	
	ПараметрыДиалога = НовыеПараметрыДиалога();
	
	Ключ = НовыеПараметрыКлюча();
	Ключ.Чат = Чат;
	ТекущиеПараметры = ПараметрыСообщения(Ключ);
	ЗаполнитьЗначенияСвойств(ПараметрыДиалога, ТекущиеПараметры);
	
	Возврат ПараметрыДиалога;
	
КонецФункции

// Устанавливает и возвращает новый идентификатор для диалога.
//
// Параметры:
//  Чат - СправочникСсылка.бит_ЧатыTelegram.
//
// Возвращаемое значение:
//	Строка.
//
Функция НовыйИдентификаторДиалога(Чат) Экспорт
	
	ИдентификаторДиалога = Строка(Новый УникальныйИдентификатор);
	
	МенеджерПараметров = СоздатьМенеджерЗаписи();
	МенеджерПараметров.Чат               = Чат;
	МенеджерПараметров.СообщениеИД       = 0;
	МенеджерПараметров.Параметр          = "ИдентификаторДиалога";
	МенеджерПараметров.ЗначениеПараметра = ИдентификаторДиалога;
	МенеджерПараметров.Записать();
	
	Возврат ИдентификаторДиалога;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УстаревшиеЗаписи()
	
	АктуальнаяДата = бит_ТелеграмСервер.ГраницаАктуальнойИсторииТелеграм();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПараметрыСообщенийТелеграм.Чат КАК Чат,
	|	ПараметрыСообщенийТелеграм.СообщениеИД КАК СообщениеИД,
	|	ПараметрыСообщенийТелеграм.Параметр КАК Параметр
	|ИЗ
	|	РегистрСведений.бит_ПараметрыСообщенийТелеграм КАК ПараметрыСообщенийТелеграм
	|ГДЕ
	|	ПараметрыСообщенийТелеграм.ДатаОтправки < &ДатаОтправки
	|	И НЕ(ПараметрыСообщенийТелеграм.СообщениеИД = 0
	|				И ПараметрыСообщенийТелеграм.ДатаОтправки <> ДАТАВРЕМЯ(1, 1, 1))";
	Запрос.УстановитьПараметр("ДатаОтправки", АктуальнаяДата);
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция НовыеПараметрыДиалога()
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("ИдентификаторДиалога", "");
	Возврат ПараметрыДиалога; 
	
КонецФункции

#КонецОбласти

#КонецЕсли
